/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)
/----------------------------------------------------------------------------*/
#if defined (ESP_PLATFORM)
#include <sdkconfig.h>
#if defined (CONFIG_IDF_TARGET_ESP32)

#include "Bus_HUB75.hpp"
#include "../../misc/pixelcopy.hpp"

#include <soc/dport_reg.h>
#include <esp_log.h>

#if defined ( ESP_IDF_VERSION_VAL )
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  #define LGFX_IDF_V5
 #endif
#endif

namespace lgfx
{
 inline namespace v1
 {

  void Bus_HUB75::setImageBuffer(void* buffer, color_depth_t depth)
  {
    _depth = depth;
    auto fb = (DividedFrameBuffer*)buffer;
    _frame_buffer = fb;
    _panel_width = fb->getLineSize() / ((depth & color_depth_t::bit_mask) >> 3);
    _panel_height = fb->getTotalLines();
  }

//----------------------------------------------------------------------------

  static constexpr uint32_t _conf_reg_default = I2S_TX_MSB_RIGHT | I2S_TX_RIGHT_FIRST | I2S_RX_RIGHT_FIRST | I2S_TX_MONO;
  static constexpr uint32_t _conf_reg_start   = _conf_reg_default | I2S_TX_START;

      uint32_t x = 0;
      uint32_t xe = xe_tbl[0] >> 1;
// lgfx::gpio_lo(15);
      for (;;)
      {
        do
        {
          // RGB332の値を基にガンマテーブルを適用する
          // このテーブルの中身は単にガンマ補正をするだけでなく、
          // BGR順に1ビットずつ並んだ状態に変換する処理を兼ねている。
          uint32_t rgb_upper_1 = *s_upper++;
          uint32_t rgb_lower_1 = *s_lower++;
          uint32_t rgb_upper_2 = rgb_upper_1 >> 8;
          uint32_t rgb_lower_2 = rgb_lower_1 >> 8;

          rgb_upper_1 &= 0xFF;
          rgb_lower_1 &= 0xFF;

          rgb_upper_1 = pixel_tbl[rgb_upper_1];
          rgb_lower_1 = pixel_tbl[rgb_lower_1];
          rgb_upper_2 = pixel_tbl[rgb_upper_2];
          rgb_lower_2 = pixel_tbl[rgb_lower_2];

          // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
          uint32_t rgb_1 = rgb_upper_1 + (rgb_lower_1 << 3);
          uint32_t rgb_2 = rgb_upper_2 + (rgb_lower_2 << 3);

          d32[len32 * 0] = yys[TRANSFER_PERIOD_COUNT - 1];
          d32[len32 * 1] = yys[0];
          d32[len32 * 2] = yys[1];
          d32[len32 * 3] = yys[2];

          int32_t i = 3;
          uint32_t pixel_2 = rgb_2 & 0x3F;
          uint32_t pixel_1 = rgb_1 & 0x3F;
          pixel_2 += yys[i];
          pixel_1 <<= 16;
          d32[++i * len32] = pixel_1 + pixel_2;
          do
          {
            rgb_2 >>= 6;
            rgb_1 >>= 6;
            pixel_2 = rgb_2 & 0x3F;
            pixel_1 = rgb_1 & 0x3F;
            pixel_2 += yys[i];
            pixel_1 <<= 16;
            // 横２列ぶん同時にバッファにセットする
            d32[++i * len32] = pixel_1 + pixel_2;
          } while (i < TRANSFER_PERIOD_COUNT);

          ++d32;
        } while (++x < xe);
        if (xe_idx == TRANSFER_PERIOD_COUNT) break;
        do {
          yys[++xe_idx] = yy_oe;
          xe = xe_tbl[xe_idx] >> 1;
        } while (x >= xe);
      }
// lgfx::gpio_hi(15);

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (xe_tbl[TRANSFER_PERIOD_COUNT-1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (xe_tbl[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      d32 += len32 * 7;

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        {
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }

  struct asm_work_t
  {
    uint32_t* d32;            //  0
    uint32_t* s32h;           //  4
    uint32_t* s32l;           //  8
    uint32_t* pixel_tbl;      // 12
    uint32_t* mixdata;        // 16
    uint16_t* xe_tbl;         // 20
    uint32_t len32;           // 24
    uint32_t xe_idx;          // 28
    uint32_t xe;              // 32
    uint32_t dummy_;          // 36
    uint32_t mix_value;       // 40
    uint32_t* _retaddr;       // 44 A0保管用
  };

  void asmHub75Draw565(asm_work_t* work)
  /*
    A0 : リターンアドレス (workに退避して使用)
    A1 : スタックポインタ (変更不可)
    A2 : asm_work_t*      (変更不可)
  */
  {
    __asm__ __volatile__ (
      "s32i.n  a0,  a2,  44               \n" // A0 を退避
      "movi    a0,  0b111000111000111000111000111000   \n"  // A0 にマスクパターンをセット
      "l32i.n  a11, a2,   4               \n" // ★a11 = パネル上側の元データ配列
      "l32i.n  a12, a2,   8               \n" // ★a12 = パネル下側の元データ配列
      "l32i.n  a14, a2,   0               \n" // ★a14 = 出力先アドレス
   // "l32i.n  a13, a2,  28               \n" // ★a13 = x
      "movi.n  a13, 0                     \n" // ★a13 = x

"XLOOP_START:                       \n"

      "l32i.n  a5,  a11,  0               \n" // a5 = 元データ配列から swap565形式 2ピクセル まとめて取得
      "l32i.n  a6,  a12,  0               \n" // a6 = 元データ配列から swap565形式 2ピクセル まとめて取得
      "l32i.n  a15, a2,  12               \n" // ★A15 = pixel_tbl
