/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)
/----------------------------------------------------------------------------*/
#if defined (ESP_PLATFORM)
#include <sdkconfig.h>
#if defined (CONFIG_IDF_TARGET_ESP32)

#include "Bus_HUB75.hpp"
#include "../../misc/pixelcopy.hpp"

#include <soc/dport_reg.h>
#include <esp_log.h>

#if defined ( ESP_IDF_VERSION_VAL )
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  #define LGFX_IDF_V5
 #endif
#endif

namespace lgfx
{
 inline namespace v1
 {

//----------------------------------------------------------------------------

  static constexpr uint32_t _conf_reg_default = I2S_TX_MSB_RIGHT | I2S_TX_RIGHT_FIRST | I2S_RX_RIGHT_FIRST | I2S_TX_MONO;
  static constexpr uint32_t _conf_reg_start   = _conf_reg_default | I2S_TX_START;
  static constexpr uint32_t _conf_reg_reset   = _conf_reg_default | I2S_TX_RESET;
  static constexpr uint32_t _sample_rate_conf_reg_direct = 16 << I2S_TX_BITS_MOD_S | 16 << I2S_RX_BITS_MOD_S | 1 << I2S_TX_BCK_DIV_NUM_S | 1 << I2S_RX_BCK_DIV_NUM_S;

          send_led_driver_command(6, cmd6, cmd6, cmd6); // write cfg reg 2
          send_led_driver_latch(14);  // Pre-active cmd
          send_led_driver_command(8, cmd8, cmd8, cmd8); // write cfg reg 3
          send_led_driver_latch(14);  // Pre-active cmd
          send_led_driver_command(10, cmd10, cmd10, cmd10); // write cfg reg 4
          send_led_driver_latch(14);  // Pre-active cmd
          send_led_driver_command(2, 0, 0, 0); // write debug reg
        }
        break;
      }
    }

    switch_gpio_control(true);

    auto i2s_dev = (i2s_dev_t*)_dev;
    i2s_dev->out_link.val = 0;
    i2s_dev->fifo_conf.val = _fifo_conf_dma;
    i2s_dev->sample_rate_conf.val = _sample_rate_conf_reg_direct;

    i2s_dev->clkm_conf.val = getClockDivValue(_cfg.freq_write);
    i2s_dev->conf.val = _conf_reg_reset;
    i2s_dev->out_link.val = I2S_OUTLINK_START | ((uint32_t)_dmadesc & I2S_OUTLINK_ADDR);

    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->int_ena.out_eof = 1;

#if portNUM_PROCESSORS > 1
    if (((size_t)_cfg.task_pinned_core) < portNUM_PROCESSORS)
    {
      xTaskCreatePinnedToCore(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle, _cfg.task_pinned_core);
    }
    else
#endif
    {
      xTaskCreate(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle);
    }
  }

  void Bus_HUB75::setRefreshRate(uint16_t refresh_rate)
  {
    // 総転送データ量とリフレッシュレートに基づいて送信クロックを設定する
    _cfg.freq_write = (_dma_transfer_len >> 1) * _panel_height * refresh_rate;
    auto i2s_dev = (i2s_dev_t*)_dev;
    if (i2s_dev)
    {
      i2s_dev->clkm_conf.val = getClockDivValue(_cfg.freq_write);
    }
  }

  void Bus_HUB75::endTransaction(void)
  {
    gpio_hi(_cfg.pin_oe);
#if defined ( LGFX_IDF_V5 )
    esp_rom_gpio_connect_out_signal(_cfg.pin_oe, SIG_GPIO_OUT_IDX, 0, 0);
#else
    gpio_matrix_out(_cfg.pin_oe, SIG_GPIO_OUT_IDX, 0, 0);
#endif

    auto i2s_dev = (i2s_dev_t*)_dev;
    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->out_link.stop = 1;
    i2s_dev->conf.val = _conf_reg_reset;
    i2s_dev->out_link.val = 0;

    if (_dmatask_handle)
    {
      auto handle = _dmatask_handle;
      _dmatask_handle = nullptr;
      xTaskNotify(handle, 0, eNotifyAction::eSetValueWithOverwrite);
      vTaskDelay(1);
    }

    if (_pixel_tbl)
    {
      heap_free(_pixel_tbl);
      _pixel_tbl = nullptr;
    }
    if (_dmadesc)
    {
      heap_free(_dmadesc);
      _dmadesc = nullptr;
    }
    for (size_t i = 0; i < _dma_desc_set; i++)
    {
      if (_dma_buf[i])
      {
        heap_free(_dma_buf[i]);
        _dma_buf[i] = nullptr;
      }
    }
  }

  void IRAM_ATTR Bus_HUB75::i2s_intr_handler_hub75(void *arg)
  {
    auto me = (Bus_HUB75*)arg;
    auto dev = getDev(me->_cfg.i2s_port);
    dev->int_clr.val = dev->int_st.val;

    auto desc = (lldesc_t*)dev->out_eof_des_addr;
    xTaskNotifyFromISR(me->_dmatask_handle, (uint32_t)desc->buf, eNotifyAction::eSetValueWithOverwrite, nullptr);
    portYIELD_FROM_ISR();
  }

  struct asm_work_t
  {
    uint32_t* d32;            //  0
    uint32_t* s32h;           //  4
    uint32_t* s32l;           //  8
    uint32_t* pixel_tbl;      // 12
    uint32_t* mixdata;        // 16
    uint16_t* xe_tbl;         // 20
    uint32_t len32;           // 24
    uint32_t xe_idx;          // 28
    uint32_t xe;              // 32
    uint32_t mask3bit;        // 36
    uint32_t mix_value;       // 40
    uint32_t* _retaddr;       // 44 A0保管用
  };

  static void hub75Draw332_asm(asm_work_t* work)
  {
/* 関数が呼び出された直後のレジスタの値
    a0 : リターンアドレス (workに退避し、a0を別の用途に使用)
    a1 : スタックポインタ (変更不可)
    a2 : asm_work_t*      (変更せずそのまま利用する)
*/
    __asm__ __volatile__ (
      "s32i.n  a0,  a2,  44               \n"  // A0 を退避
      "l32i.n  a3,  a2,  32               \n"  // a3  = xe
      "l32i.n  a0,  a2,  0                \n"  // ★a0  = 出力先アドレス
      "l32i.n  a15, a2,  16               \n"  // ★a15 = mixdata アドレス
      "l32i.n  a14, a2,  24               \n"  // ★a14 = len32
      "l32i.n  a13, a2,  12               \n"  // ★a13 = pixel_tbl
      "l32i.n  a12, a2,  8                \n"  // ★a12 = パネル下側の元データ配列
      "l32i.n  a11, a2,  4                \n"  // ★a11 = パネル上側の元データ配列
      "slli    a14, a14, 2                \n"  // len32 を 4倍(d32の加算に使うため)

"HUB75_DRAW332_LOOP_START:          \n"

